interface EventsProps {
    year: number,
    text: string
}
export interface IData {
    id: number,
    name: string,
    yearLeft: number,
    yearRight: number,
    events: EventsProps[]
}
export const data: IData[] = [
    {
        id: 1,
        name: 'Театр',
        yearLeft: 1979,
        yearRight: 1987,
        events: [
            { year: 1979, text: "Премьера спектакля «Ревизор» в Театре на Таганке, реж. Юрий Любимов" },
            { year: 1980, text: "Открытие Московского театра «Сатирикон», худрук — Аркадий Райкин" },
            { year: 1981, text: "Премьера пьесы «Дядя Ваня» в МХАТе, постановка Олега Ефремова" },
            { year: 1983, text: "Спектакль «Поминальная молитва» поставлен Марком Захаровым в театре «Ленком»" },
            { year: 1984, text: "Начало работы Александра Калягина в театре «Эрмитаж» как режиссёра и актёра" },
            { year: 1985, text: "Возвращение Юрия Любимова в Театр на Таганке после эмиграции" },
            { year: 1986, text: "Открытие международного театрального фестиваля «Балтийский дом» в Ленинграде" },
            { year: 1987, text: "Премьера спектакля «Гамлет» в театре им. Вахтангова, реж. Роберт Стуруа" }
        ],
    },
    {
        id: 2,
        name: 'Кино',
        yearLeft: 1987,
        yearRight: 1993,
        events: [
            { year: 1987, text: "«Хищник» / Predator, США (реж. Джон МакТирнан)" },
            { year: 1988, text: "«Кто подставил кролика Роджера» / Who Framed Roger Rabbit, США (реж. Роберт Земекис)" },
            { year: 1989, text: "«Назад в будущее 2» / Back to the Future Part II, США (реж. Роберт Земекис)" },
            { year: 1990, text: "«Крепкий орешек 2» / Die Hard 2, США (реж. Ренни Харлин)" },
            { year: 1991, text: "«Молчание ягнят» / The Silence of the Lambs, США (реж. Джонатан Демме)" },
            { year: 1992, text: "«Игры разума» / A Beautiful Mind, США (реж. Рон Ховард)" },
            { year: 1993, text: "«Список Шиндлера» / Schindler’s List, США (реж. Стивен Спилберг)" }
        ],
    },
    {
        id: 3,
        name: 'Литература',
        yearLeft: 1992,
        yearRight: 1997,
        events: [
            { year: 1992, text: "Выход романа Виктора Пелевина «Омон Ра», Россия" },
            { year: 1993, text: "Публикация романа «Парфюмер» Патрика Зюскинда на русском языке" },
            { year: 1994, text: "Выход романа «Трудно быть богом» в авторской редакции Стругацких" },
            { year: 1995, text: "Присуждение Нобелевской премии по литературе ирландцу Шеймасу Хини" },
            { year: 1996, text: "Выход романа «Generation 'П'» Виктора Пелевина, Россия" },
            { year: 1997, text: "Выход первой книги о Гарри Поттере — «Гарри Поттер и философский камень», Дж. К. Роулинг, Великобритания" },
            { year: 1997, text: "Публикация последнего романа В. Аксенова «Вольтерьянцы и вольтерьянки»" },
            { year: 1997, text: "Милан Кундера публикует «Неведение» — философский роман о ностальгии" }
        ],
    },
    {
        id: 4,
        name: 'Архитектура',
        yearLeft: 1999,
        yearRight: 2004,
        events: [
            { year: 1999, text: "Открытие музея Гуггенхайма в Бильбао, проект архитектора Фрэнка Гери" },
            { year: 2000, text: "Завершено строительство Башни Цитигрупп в Нью-Йорке" },
            { year: 2001, text: "Открытие Национального музея искусств XXI века в Риме" },
            { year: 2002, text: "Начало строительства Всемирного торгового центра в Нью-Йорке после атак 11 сентября" },
            { year: 2003, text: "Открытие Центра Помпиду-Метц во Франции" },
            { year: 2004, text: "Завершено строительство Башни Токийского города с 54 этажами" },
        ],
    },
    {
        id: 5,
        name: 'Музыка',
        yearLeft: 2005,
        yearRight: 2014,
        events: [
            { year: 2005, text: "Выход альбома Coldplay 'X&Y', который стал коммерчески успешным" },
            { year: 2007, text: "Появление iPhone и рост популярности цифровой музыки через iTunes" },
            { year: 2008, text: "Бейонсе выпускает альбом 'I Am... Sasha Fierce' с хитами 'Single Ladies' и 'Halo'" },
            { year: 2010, text: "Lady Gaga выпускает альбом 'The Fame Monster', укрепляя статус поп-иконы" },
            { year: 2011, text: "Адель выпускает альбом '21', который становится одним из самых продаваемых в десятилетии" },
            { year: 2013, text: "Daft Punk выпускает альбом 'Random Access Memories' с хитом 'Get Lucky'" },
            { year: 2014, text: "Появление и массовый рост популярности стриминговых сервисов, таких как Spotify" },
        ],
    },
    {
        id: 6,
        name: 'Наука',
        yearLeft: 2015,
        yearRight: 2022,
        events: [
            { year: 2015, text: "13 сентября — частное солнечное затмение, видимое в Северной Америке" },
            { year: 2016, text: "Телескоп «Хаббл» обнаружил самую удалённую галактику на тот момент — GN-z11" },
            { year: 2017, text: "Компания Tesla представила первый электрический грузовик Tesla Semi" },
            { year: 2018, text: "Обнаружение гравитационных волн от слияния нейтронных звёзд LIGO и Virgo" },
            { year: 2019, text: "Впервые получено изображение чёрной дыры в центре галактики M87 телескопом Event Horizon Telescope" },
            { year: 2020, text: "Начало массовой вакцинации против COVID-19 на основе мРНК-вакцин" },
            { year: 2021, text: "Успешная посадка ровера Perseverance на Марс" },
            { year: 2022, text: "Объявление о новых открытиях в области термоядерного синтеза с положительным энергетическим балансом" },
        ],
    }
];